SigninLogs
| extend OS = DeviceDetail.operatingSystem, Browser = DeviceDetail.browser
| extend Date = datetime_utc_to_local(TimeGenerated,'US/Central')
| where TimeGenerated < ago(7d)
| where UserPrincipalName == "mark.connelly@carle.com"
| project Date, Location, IPAddress, UserPrincipalName, AppDisplayName, ConditionalAccessStatus, OS, Browser

AuditLogs
| extend Date = datetime_utc_to_local(TimeGenerated,'US/Central')
| extend initiatedBy = tostring(InitiatedBy.user.userPrincipalName)
| project-raname OperationType = AADOperationType
| project Date, initiatedBy, OperationType, Category, TargetResources

AzureActivity
| extend Date = datetime_utc_to_local(TimeGenerated,'US/Central')
| where Caller contains "mark.connelly@carle.com"
| project Date, Caller, ResourceGroup, OperationNameValue, ActivityStatusValue

AADUserRiskEvents
| extend Date = datetime_utc_to_local(TimeGenerated,'US/Central')
| where UserDisplayName contains "mark.connelly@carle.com"

OfficeActivity
| extend Date = datetime_utc_to_local(TimeGenerated,'US/Central')
| where UserId = "mark.connelly@carle.com"
| project Date, OfficeWorkload, Operation



SigninLogs 
| extend OS = DeviceDetail.operatingSystem, Browser = DeviceDetail.browser
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[0].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[1].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[2].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[3].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[4].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[5].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[6].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[7].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[8].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[9].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[10].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[11].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[12].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[13].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[14].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[15].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[16].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[17].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[18].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[19].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[20].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[21].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[22].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[23].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[24].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[25].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[26].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[27].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[28].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[29].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[30].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[31].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[32].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[33].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[34].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[35].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)
| extend ConditionalAccessPol0Name = tostring(ConditionalAccessPolicies[36].displayName), ConditionalAccessPol0Result = tostring(ConditionalAccessPolicies[0].result)
| extend ConditionalAccessPol1Name = tostring(ConditionalAccessPolicies[37].displayName), ConditionalAccessPol1Result = tostring(ConditionalAccessPolicies[1].result)
| extend ConditionalAccessPol2Name = tostring(ConditionalAccessPolicies[38].displayName), ConditionalAccessPol2Result = tostring(ConditionalAccessPolicies[2].result)

| extend StatusCode = tostring(Status.errorCode), StatusDetails = tostring(Status.additionalDetails)
| extend State = tostring(LocationDetails.state), City = tostring(LocationDetails.city)
| extend Date = startofday(TimeGenerated), Hour = datetime_part("Hour", TimeGenerated)
| summarize count() by Date, Identity, UserDisplayName, UserPrincipalName, IPAddress, ResultType, ResultDescription, StatusCode, StatusDetails, 
ConditionalAccessPol0Name, ConditionalAccessPol0Result, ConditionalAccessPol1Name, ConditionalAccessPol1Result, ConditionalAccessPol2Name, ConditionalAccessPol2Result, 
Location, State, City
| extend timestamp = Date, AccountCustomEntity = UserPrincipalName, IPCustomEntity = IPAddress
| sort by Date